app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("nameproduct", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nameproduct", "1111"], ["avatar", "1111"], ["created_at", "2015-07-29 07:12:21.104678"], ["updated_at", "2015-07-29 07:12:21.104678"]]