app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("name", "avatar", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "12345678"], ["avatar", "Screenshot_from_2015-07-17_23_29_06.png"], ["user_id", 1], ["created_at", "2015-07-28 14:05:23.545551"], ["updated_at", "2015-07-28 14:05:23.545551"]]
---
  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    @profile.avatar = params[:avatar]
    respond_to do |format|
      if @profile.save

UPDATE "profiles" SET "avatar" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["avatar", "#<ActionDispatch::Http::UploadedFile:0x0000000c1a96c0>"], ["updated_at", "2015-07-28 13:53:19.585977"], ["id", 1]]
---
  def update
    # respond_to do |format|
      if @profile.update(profile_params)